export const topics = [
    // カリキュラムのトピック
    "AWS",
    "HTML", "CSS", "JavaScript",
    "サーバー",
    "PHP",
    "Laravel",
    "データベース",
    "Git&GitHub",
    "マイグレーション", "リレーション", "認証機能", "API",
    "その他",
    // 成果物のトピック
    "認証機能", "API", "画像処理", "Heroku環境", "デザイン", "その他"
];

export const categories = ["カリキュラム", "成果物"];

export const curriculumNumbers = [
    [
        ["1-1-1"],
        ["2-1-1"],
        ["2-1-2"],
        ["2-1-3"],
        ["3-1-1"],
        ["4-1-1", "4-1-2", "4-1-3", "4-1-4"],
        ["5-1-1", "8-1-1", "8-2-1", "8-3-1", "8-4-1", "8-5-1", "8-6-1"],
        ["6-1-1", "6-2-1"],
        ["7-1-1"],
        ["9-1-1"],
        ["9-2-1"],
        ["9-3-1"],
        ["9-4-1"],
        ["その他"]
    ],
    [["成果物"], ["その他"]]
];
